package core

var luoxueClassTypes = map[string][]string{
	"movie":   {"剧情片", "喜剧片", "动作片", "动画片", "科幻片", "奇幻片", "恐怖片", "惊悚片", "爱情片", "悬疑片", "犯罪片", "战争片", "伦理片", "记录片", "纪录片", "动漫电影", "其他片", "电影", "电影（B站）", "冒险篇", "短片", "影视解说", "剧情", "喜剧", "动作", "恐怖", "悬疑"},
	"series":  {"国产剧", "陆剧", "内地剧", "电视剧", "电视剧（B站）", "美剧", "欧美剧", "海外剧", "日本剧", "日剧", "韩国剧", "韩剧", "日韩剧", "泰国剧", "泰剧", "东南亚剧", "香港剧", "台湾剧", "台剧", "纪录剧集", "短剧", "爽文短剧", "其他短剧", "反转爽剧", "现代都市短剧", "年代穿越短剧", "女频恋爱短剧", "古装仙侠短剧", "脑洞悬疑短剧", "AI漫剧"},
	"anime":   {"国产动漫", "中国动漫", "日韩动漫", "日本动漫", "欧美动漫", "港台动漫", "国创", "国创（B站）", "国创(b站)", "番剧（B站）", "番剧(b站)", "动漫", "动画", "少儿", "少儿动漫"},
	"variety": {"综艺", "大陆综艺", "日韩综艺", "港台综艺", "韩国综艺", "香港综艺", "台湾综艺", "欧美综艺", "网球", "篮球"},
}
